
# M24 — Soluções do Questionário (SQL & Análise com Pandas)

Este notebook contém as respostas aos questionários do **Módulo 24** usando a planilha `TB_VENDAS_TAREFA.csv`.
- Carregamento correto do CSV (separador `;` e conversão numérica).
- Respostas numéricas e tabelas para Q1–Q5.
- Respostas conceituais para Q6–Q8.
- Um bloco com as **queries SQL sugeridas**.

In [6]:

import pandas as pd

csv_path = ("G:\Meu Drive\Programação\Ciencia de dados\Aprofundamento de Analytics\Banco de dados + SQL\TB_VENDAS_TAREFA.csv")  # ajuste o caminho se necessário

# Carregar CSV com separador ';'
df = pd.read_csv(csv_path, sep=";", encoding="utf-8")

# Conversões numéricas (trata decimal com vírgula, se houver)
for c in ["VALOR_UNID", "UNIDADES"]:
    if df[c].dtype == object:
        try:
            df[c] = (df[c]
                     .str.replace(".", "", regex=False)
                     .str.replace(",", ".", regex=False)
                    )
        except Exception:
            pass
    df[c] = pd.to_numeric(df[c], errors="coerce")

df.head()

   ID_COMPRA  ID_CLIENTE   PRODUTO  VALOR_UNID  UNIDADES
0       1247        9081  CAMISETA        34.5         2
1       1248        9081     CALCA        89.9         1
2       1250        9560  CAMISETA        34.5         1
3       1249        9630   BERMUDA        79.5         2
4       1251        9425  CAMISETA        34.5         3

## Q1) Retorne todos os dados da tabela (visualização)

In [7]:

# Exibe o dataframe completo (cuidado com tamanho). Aqui, mostramos as primeiras 50 linhas.
df.head(50)

    ID_COMPRA  ID_CLIENTE   PRODUTO  VALOR_UNID  UNIDADES
0        1247        9081  CAMISETA        34.5         2
1        1248        9081     CALCA        89.9         1
2        1250        9560  CAMISETA        34.5         1
3        1249        9630   BERMUDA        79.5         2
4        1251        9425  CAMISETA        34.5         3
5        1252        9425   VESTIDO       102.0         1
6        1253        9481     CALCA        89.9         2
7        1254        9785      MEIA        25.9         1
8        1255        9786     CALCA        89.9         2
9        1256        9787   VESTIDO       102.0         1
10       1257        9788     CALCA        89.9         2
11       1258        9789  CAMISETA        34.5         3
12       1259        9790  CAMISETA        34.5         1
13       1260        9791   BERMUDA        79.5         2
14       1261        9792  CAMISETA        34.5         2
15       1262        9793     CALCA        89.9         2
16       1263        9794     CALCA        89.9         1
17       1264        9795   BERMUDA        79.5         2
18       1265        9796  CAMISETA        34.5         4
19       1266        9797  CAMISETA        34.5         1
20       1267        9798   VESTIDO       102.0         2
21       1268        9799      MEIA        25.9         3
22       1269        9800  CAMISETA        34.5         2
23       1270        9801     CALCA        89.9         1

## Q2) Retorne apenas 10 linhas da coluna `PRODUTO`

In [8]:

df[["PRODUTO"]].head(10)

    PRODUTO
0  CAMISETA
1     CALCA
2  CAMISETA
3   BERMUDA
4  CAMISETA
5   VESTIDO
6     CALCA
7      MEIA
8     CALCA
9   VESTIDO

## Q3) Média do valor por unidade e das unidades vendidas (com alias)

In [9]:

media_valor_unid = df["VALOR_UNID"].mean()
media_unidades   = df["UNIDADES"].mean()
print(f"média_VALOR_UNID = {media_valor_unid:.2f}")
print(f"média_UNIDADES   = {media_unidades:.2f}")

média_VALOR_UNID = 64.00
média_UNIDADES   = 1.83

## Q4) Valor total por compra (VALOR_TOTAL = VALOR_UNID * UNIDADES)

In [10]:

df["VALOR_TOTAL"] = df["VALOR_UNID"] * df["UNIDADES"]
df.head(50)

    ID_COMPRA  ID_CLIENTE   PRODUTO  VALOR_UNID  UNIDADES  VALOR_TOTAL
0        1247        9081  CAMISETA        34.5         2         69.0
1        1248        9081     CALCA        89.9         1         89.9
2        1250        9560  CAMISETA        34.5         1         34.5
3        1249        9630   BERMUDA        79.5         2        159.0
4        1251        9425  CAMISETA        34.5         3        103.5
5        1252        9425   VESTIDO       102.0         1        102.0
6        1253        9481     CALCA        89.9         2        179.8
7        1254        9785      MEIA        25.9         1         25.9
8        1255        9786     CALCA        89.9         2        179.8
9        1256        9787   VESTIDO       102.0         1        102.0
10       1257        9788     CALCA        89.9         2        179.8
11       1258        9789  CAMISETA        34.5         3        103.5
12       1259        9790  CAMISETA        34.5         1         34.5
13       1260        9791   BERMUDA        79.5         2        159.0
14       1261        9792  CAMISETA        34.5         2         69.0
15       1262        9793     CALCA        89.9         2        179.8
16       1263        9794     CALCA        89.9         1         89.9
17       1264        9795   BERMUDA        79.5         2        159.0
18       1265        9796  CAMISETA        34.5         4        138.0
19       1266        9797  CAMISETA        34.5         1         34.5
20       1267        9798   VESTIDO       102.0         2        204.0
21       1268        9799      MEIA        25.9         3         77.7
22       1269        9800  CAMISETA        34.5         2         69.0
23       1270        9801     CALCA        89.9         1         89.9

## Q5) [DESAFIO] Média do `VALOR_TOTAL` (apenas essa informação)

In [11]:

media_valor_total = (df["VALOR_UNID"] * df["UNIDADES"]).mean()
print(f"média_VALOR_TOTAL = {media_valor_total:.2f}")

média_VALOR_TOTAL = 109.71


## Q6) Diferencie a utilidade do SQL e do Python na área de dados

- **SQL**: Consultar, filtrar, agregar e combinar dados **direto no banco** de forma eficiente; ótimo para **ETL/ELT** e **explorações rápidas**.
- **Python**: Análise **pós-extração**, modelagem, visualização, automações, ML; integra bibliotecas (pandas, numpy, scikit-learn, matplotlib etc.).

**Resumo:** SQL é o “motor” de **consulta e preparo inicial**; Python é o “laboratório” para **análise avançada e modelos**.


## Q7) Banco de dados **relacionais** vs **não relacionais**

- **Relacional (SQL)**: tabelas, **esquema rígido**, **JOINs**, **ACID** forte; ideal para dados estruturados e consistência (ex.: vendas, ERP).
- **Não relacional (NoSQL)**: documentos/pares chave-valor/grafos/colunar, **esquema flexível**, escala horizontal; ideal para **alto volume/variedade/velocidade** (ex.: logs, catálogos flexíveis, sessões).


## Q8) SQL pode ser mais prático que Python para consultas rápidas?

Sim. Para **seleções, filtros, agregações e JOINs**, o SQL é direto e evita mover grandes volumes para a aplicação.
Python brilha quando é preciso **limpeza complexa, estatística, ML, gráficos e automações**.

## Queries SQL sugeridas (Q1–Q5)

In [5]:

sql = '''
-- Q1) Todos os dados
SELECT * FROM TB_VENDAS;

-- Q2) Apenas 10 linhas da coluna produto
SELECT PRODUTO
FROM TB_VENDAS
LIMIT 10;

-- Q3) Média do valor por unidade e das unidades vendidas
SELECT 
  AVG(VALOR_UNID) AS media_valor_unid,
  AVG(UNIDADES)   AS media_unidades
FROM TB_VENDAS;

-- Q4) Valor total por compra
SELECT 
  ID_COMPRA,
  ID_CLIENTE,
  PRODUTO,
  VALOR_UNID,
  UNIDADES,
  (VALOR_UNID * UNIDADES) AS valor_total
FROM TB_VENDAS;

-- Q5) [DESAFIO] Média do valor_total (apenas essa informação)
SELECT 
  AVG(VALOR_UNID * UNIDADES) AS media_valor_total
FROM TB_VENDAS;
'''
print(sql)

-- Q1) Todos os dados
SELECT * FROM TB_VENDAS;

-- Q2) Apenas 10 linhas da coluna produto
SELECT PRODUTO
FROM TB_VENDAS
LIMIT 10;

-- Q3) Média do valor por unidade e das unidades vendidas
SELECT
  AVG(VALOR_UNID) AS media_valor_unid,
  AVG(UNIDADES)   AS media_unidades
FROM TB_VENDAS;

-- Q4) Valor total por compra
SELECT
  ID_COMPRA,
  ID_CLIENTE,
  PRODUTO,
  VALOR_UNID,
  UNIDADES,
  (VALOR_UNID * UNIDADES) AS valor_total
FROM TB_VENDAS;

-- Q5) [DESAFIO] Média do valor_total (apenas essa informação)
SELECT
  AVG(VALOR_UNID * UNIDADES) AS media_valor_total
FROM TB_VENDAS;